; domain
(define (domain bush-expedition)
(:requirements :typing)
(:types jeep tourist - safari_entity
safari_entity waterhole range - object)
(:predicates (resting-at ?x - safari_entity ?c - waterhole)
             (riding-in ?p - tourist ?a - jeep)
       (tank-level ?a - jeep ?l - range)
       (follows ?l1 ?l2 - range))


(:action mount
 :parameters (?p - tourist ?a - jeep ?c - waterhole)

 :precondition (and (resting-at ?p ?c)
                 (resting-at ?a ?c))
 :effect (and (not (resting-at ?p ?c))
              (riding-in ?p ?a)))

(:action dismount
 :parameters (?p - tourist ?a - jeep ?c - waterhole)

 :precondition (and (riding-in ?p ?a)
                 (resting-at ?a ?c))
 :effect (and (not (riding-in ?p ?a))
              (resting-at ?p ?c)))

(:action cruise
 :parameters (?a - jeep ?c1 ?c2 - waterhole ?l1 ?l2 - range)

 :precondition (and (resting-at ?a ?c1)
                 (tank-level ?a ?l1)
     (follows ?l2 ?l1))
 :effect (and (not (resting-at ?a ?c1))
              (resting-at ?a ?c2)
              (not (tank-level ?a ?l1))
              (tank-level ?a ?l2)))

(:action dash
 :parameters (?a - jeep ?c1 ?c2 - waterhole ?l1 ?l2 ?l3 - range)

 :precondition (and (resting-at ?a ?c1)
                 (tank-level ?a ?l1)
     (follows ?l2 ?l1)
     (follows ?l3 ?l2)
    )
 :effect (and (not (resting-at ?a ?c1))
              (resting-at ?a ?c2)
              (not (tank-level ?a ?l1))
              (tank-level ?a ?l3)
  )
)

(:action replenish
 :parameters (?a - jeep ?c - waterhole ?l - range ?l1 - range)

 :precondition (and (tank-level ?a ?l)
                 (follows ?l ?l1)
                 (resting-at ?a ?c))
 :effect (and (tank-level ?a ?l1) (not (tank-level ?a ?l))))


)

; problem
(define (problem bush-expedition-p02)
(:domain bush-expedition)
(:objects
  jeep1 - jeep
  jeep2 - jeep
  jeep3 - jeep
  tourist1 - tourist
  tourist2 - tourist
  waterhole0 - waterhole
  waterhole1 - waterhole
  range0 - range
  range1 - range
  range2 - range
  range3 - range
  range4 - range
  range5 - range
  range6 - range
  )
(:init
  (resting-at jeep1 waterhole0)
  (tank-level jeep1 range1)
  (resting-at jeep2 waterhole0)
  (tank-level jeep2 range6)
  (resting-at jeep3 waterhole1)
  (tank-level jeep3 range0)
  (resting-at tourist1 waterhole1)
  (resting-at tourist2 waterhole1)
  (follows range0 range1)
  (follows range1 range2)
  (follows range2 range3)
  (follows range3 range4)
  (follows range4 range5)
  (follows range5 range6)
)
(:goal (and
  (resting-at tourist1 waterhole1)
  (resting-at tourist2 waterhole0)
  ))

)

; plan
1. (replenish jeep3 waterhole1 range0 range1)
   deleted: (tank-level jeep3 range0)
   added: (tank-level jeep3 range1)
   goals met: 1 of 2
2. (mount tourist2 jeep3 waterhole1)
   deleted: (resting-at tourist2 waterhole1)
   added: (riding-in tourist2 jeep3)
   goals met: 1 of 2
3. (cruise jeep3 waterhole1 waterhole0 range1 range0)
   deleted: (resting-at jeep3 waterhole1) (tank-level jeep3 range1)
   added: (resting-at jeep3 waterhole0) (tank-level jeep3 range0)
   goals met: 1 of 2
4. (dismount tourist2 jeep3 waterhole0)
   deleted: (riding-in tourist2 jeep3)
   added: (resting-at tourist2 waterhole0)
   goals met: 2 of 2
